gicking/STM8_headers/SVD/STM8AF6268.svd
      </registers>
      <interrupt>
        <name>TIM2_OVR_UIF</name>
        <description>TIM2_OVR_UIF interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIM2_CAPCOM_CC1IF</name>
        <description>TIM2_CAPCOM_CC1IF interrupt</description>
        <value>14</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TIM3</name>
      <baseAddress>0x5320</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>17</size>
        <usage>registers</usage>
      </addressBlock>
      <description>TIM3</description>
      <groupName>Timer</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>TIM3 control register 1</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>URS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPM</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARPE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>TIM3 interrupt enable register</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>UIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1IE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3IE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>TIM3 status register 1</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>UIF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1IF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3IF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>TIM3 status register 2</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC10F</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC20F</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>TIM3 event generation register</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>UG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1G</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2G</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1</name>
          <description>TIM3 capture/compare mode register 1</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC1S0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1S1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1PE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1M0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1M1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC1M2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2</name>
          <description>TIM3 capture/compare mode register 2</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC2S0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2S1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2PE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2M0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2M1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2M2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER1</name>
          <description>TIM3 capture/compare enable register 1</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CC1E</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1P</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2E</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2P</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTRH</name>
          <description>TIM3 counter high</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTRL</name>
          <description>TIM3 counter low</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSCR</name>
          <description>TIM3 prescaler register</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PSC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRH</name>
          <description>TIM3 auto-reload register high</description>
          <addressOffset>0x000B</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRL</name>
          <description>TIM3 auto-reload register low</description>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1H</name>
          <description>TIM3 capture/compare register 1 high</description>
          <addressOffset>0x000D</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1L</name>
          <description>TIM3 capture/compare register 1 low</description>
          <addressOffset>0x000E</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2H</name>
          <description>TIM3 capture/compare register 2 high</description>
          <addressOffset>0x000F</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2L</name>
          <description>TIM3 capture/compare register 2 low</description>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCR2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
